import os
import subprocess

CURRENT_DIR = os.getcwd()
EXEC_NAME = "main"

times = ["00 00", "00 11", "01 23", "03 41", "04 20", "05 00", 
        "06 66", "09 41", "12 00", "12 34", "13 12", "15 00",
        "20 48", "21 00", "22 80", "23 59", "24 00"]
#times = ["{} {}".format(x // 60, x % 60) for x in range(24*60 + 1)]

for i in range(len(times)):
    sp = subprocess.run(os.path.join(CURRENT_DIR, EXEC_NAME), input=times[i], stdout=subprocess.PIPE, text=True)
    out = sp.stdout.rstrip()
    print('\033[32m', "ввод:", 
          '\033[36m', times[i], 
          '\033[32m', "вывод:" , 
          '\033[36m', out[out.find(":") + 1:], '\033[39;49m')



#     1 час                                     им. падеж, ед. число
#     2 3 4 часА                                род. падеж, ед. число
#     0 5 - 12 часОВ                            род. падеж, мн. число

#     1 21 31 41 51 минутА                      им.  падеж, ед. число
#     2 3 4 22-24 32-34 42-44 52-54 минутЫ      им.  падеж, мн. число
#     5 - 20 25-30 35-40 45-50 55-59 минут      род. падеж, мн. число
#     0 ровно

#     форматы вывода:
#     h час(а/ов) m минут(а/ы) ночи/утра/дня/вечера
#     h часов ночи/утра/дня/вечера ровно
#     полночь/полдень
